perf-tests/results_v2_20260420_170456/vt/k6_stress_customers.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /Users/naghayev/Desktop/investigate_bff/perf-tests/k6_stress.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m50s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 1m20s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 010/200 VUs, 15 complete and 0 interrupted iterations
default   [   1% ] 010/200 VUs  0m01.0s/1m20.0s

running (0m02.0s), 020/200 VUs, 114 complete and 0 interrupted iterations
default   [   2% ] 020/200 VUs  0m02.0s/1m20.0s

running (0m03.0s), 030/200 VUs, 359 complete and 0 interrupted iterations
default   [   4% ] 030/200 VUs  0m03.0s/1m20.0s

running (0m04.0s), 040/200 VUs, 704 complete and 0 interrupted iterations
default   [   5% ] 040/200 VUs  0m04.0s/1m20.0s

running (0m05.0s), 050/200 VUs, 1149 complete and 0 interrupted iterations
default   [   6% ] 050/200 VUs  0m05.0s/1m20.0s

running (0m06.0s), 060/200 VUs, 1666 complete and 0 interrupted iterations
default   [   7% ] 060/200 VUs  0m06.0s/1m20.0s

running (0m07.0s), 070/200 VUs, 2289 complete and 0 interrupted iterations
default   [   9% ] 070/200 VUs  0m07.0s/1m20.0s

running (0m08.0s), 080/200 VUs, 2418 complete and 0 interrupted iterations
default   [  10% ] 080/200 VUs  0m08.0s/1m20.0s

running (0m09.0s), 089/200 VUs, 3252 complete and 0 interrupted iterations
default   [  11% ] 089/200 VUs  0m09.0s/1m20.0s

running (0m10.0s), 099/200 VUs, 4187 complete and 0 interrupted iterations
default   [  12% ] 099/200 VUs  0m10.0s/1m20.0s

running (0m11.0s), 100/200 VUs, 5108 complete and 0 interrupted iterations
default   [  14% ] 100/200 VUs  0m11.0s/1m20.0s

running (0m12.0s), 100/200 VUs, 6108 complete and 0 interrupted iterations
default   [  15% ] 100/200 VUs  0m12.0s/1m20.0s

running (0m13.0s), 100/200 VUs, 7108 complete and 0 interrupted iterations
default   [  16% ] 100/200 VUs  0m13.0s/1m20.0s

running (0m14.0s), 100/200 VUs, 7608 complete and 0 interrupted iterations
default   [  17% ] 100/200 VUs  0m14.0s/1m20.0s

running (0m15.0s), 100/200 VUs, 8208 complete and 0 interrupted iterations
default   [  19% ] 100/200 VUs  0m15.0s/1m20.0s

running (0m16.0s), 100/200 VUs, 9208 complete and 0 interrupted iterations
default   [  20% ] 100/200 VUs  0m16.0s/1m20.0s

running (0m17.0s), 100/200 VUs, 10108 complete and 0 interrupted iterations
default   [  21% ] 100/200 VUs  0m17.0s/1m20.0s

running (0m18.0s), 100/200 VUs, 11108 complete and 0 interrupted iterations
default   [  22% ] 100/200 VUs  0m18.0s/1m20.0s

running (0m19.0s), 100/200 VUs, 12108 complete and 0 interrupted iterations
default   [  24% ] 100/200 VUs  0m19.0s/1m20.0s

running (0m20.0s), 100/200 VUs, 13108 complete and 0 interrupted iterations
default   [  25% ] 100/200 VUs  0m20.0s/1m20.0s

running (0m21.0s), 100/200 VUs, 13208 complete and 0 interrupted iterations
default   [  26% ] 100/200 VUs  0m21.0s/1m20.0s

running (0m22.0s), 100/200 VUs, 14108 complete and 0 interrupted iterations
default   [  27% ] 100/200 VUs  0m22.0s/1m20.0s

running (0m23.0s), 100/200 VUs, 15108 complete and 0 interrupted iterations
default   [  29% ] 100/200 VUs  0m23.0s/1m20.0s

running (0m24.0s), 100/200 VUs, 16108 complete and 0 interrupted iterations
default   [  30% ] 100/200 VUs  0m24.0s/1m20.0s

running (0m25.0s), 100/200 VUs, 17008 complete and 0 interrupted iterations
default   [  31% ] 100/200 VUs  0m25.0s/1m20.0s

running (0m26.0s), 100/200 VUs, 18008 complete and 0 interrupted iterations
default   [  32% ] 100/200 VUs  0m26.0s/1m20.0s

running (0m27.0s), 100/200 VUs, 18608 complete and 0 interrupted iterations
default   [  34% ] 100/200 VUs  0m27.0s/1m20.0s

running (0m28.0s), 100/200 VUs, 19108 complete and 0 interrupted iterations
default   [  35% ] 100/200 VUs  0m28.0s/1m20.0s

running (0m29.0s), 100/200 VUs, 20108 complete and 0 interrupted iterations
default   [  36% ] 100/200 VUs  0m29.0s/1m20.0s

running (0m30.0s), 100/200 VUs, 21108 complete and 0 interrupted iterations
default   [  37% ] 100/200 VUs  0m30.0s/1m20.0s

running (0m31.0s), 100/200 VUs, 22008 complete and 0 interrupted iterations
default   [  39% ] 100/200 VUs  0m31.0s/1m20.0s

running (0m32.0s), 100/200 VUs, 23008 complete and 0 interrupted iterations
default   [  40% ] 100/200 VUs  0m32.0s/1m20.0s

running (0m33.0s), 100/200 VUs, 24008 complete and 0 interrupted iterations
default   [  41% ] 100/200 VUs  0m33.0s/1m20.0s

running (0m34.0s), 100/200 VUs, 24108 complete and 0 interrupted iterations
default   [  42% ] 100/200 VUs  0m34.0s/1m20.0s

running (0m35.0s), 100/200 VUs, 25108 complete and 0 interrupted iterations
default   [  44% ] 100/200 VUs  0m35.0s/1m20.0s

running (0m36.0s), 100/200 VUs, 26108 complete and 0 interrupted iterations
default   [  45% ] 100/200 VUs  0m36.0s/1m20.0s

running (0m37.0s), 100/200 VUs, 27108 complete and 0 interrupted iterations
default   [  46% ] 100/200 VUs  0m37.0s/1m20.0s

running (0m38.0s), 100/200 VUs, 28008 complete and 0 interrupted iterations
default   [  47% ] 100/200 VUs  0m38.0s/1m20.0s

running (0m39.0s), 100/200 VUs, 29008 complete and 0 interrupted iterations
default   [  49% ] 100/200 VUs  0m39.0s/1m20.0s

running (0m40.0s), 100/200 VUs, 29608 complete and 0 interrupted iterations
default   [  50% ] 100/200 VUs  0m40.0s/1m20.0s

running (0m41.0s), 109/200 VUs, 30138 complete and 0 interrupted iterations
default   [  51% ] 109/200 VUs  0m41.0s/1m20.0s

running (0m42.0s), 119/200 VUs, 31273 complete and 0 interrupted iterations
default   [  52% ] 119/200 VUs  0m42.0s/1m20.0s

running (0m43.0s), 129/200 VUs, 32508 complete and 0 interrupted iterations
default   [  54% ] 129/200 VUs  0m43.0s/1m20.0s

running (0m44.0s), 139/200 VUs, 33843 complete and 0 interrupted iterations
default   [  55% ] 139/200 VUs  0m44.0s/1m20.0s

running (0m45.0s), 149/200 VUs, 35209 complete and 0 interrupted iterations
default   [  56% ] 149/200 VUs  0m45.0s/1m20.0s

running (0m46.0s), 159/200 VUs, 36744 complete and 0 interrupted iterations
default   [  57% ] 159/200 VUs  0m46.0s/1m20.0s

running (0m47.0s), 169/200 VUs, 36994 complete and 0 interrupted iterations
default   [  59% ] 169/200 VUs  0m47.0s/1m20.0s

running (0m48.0s), 179/200 VUs, 38729 complete and 0 interrupted iterations
default   [  60% ] 179/200 VUs  0m48.0s/1m20.0s

running (0m49.0s), 189/200 VUs, 40564 complete and 0 interrupted iterations
default   [  61% ] 189/200 VUs  0m49.0s/1m20.0s

running (0m50.0s), 199/200 VUs, 42499 complete and 0 interrupted iterations
default   [  62% ] 199/200 VUs  0m50.0s/1m20.0s

running (0m51.0s), 200/200 VUs, 44498 complete and 0 interrupted iterations
default   [  64% ] 200/200 VUs  0m51.0s/1m20.0s

running (0m52.0s), 200/200 VUs, 46498 complete and 0 interrupted iterations
default   [  65% ] 200/200 VUs  0m52.0s/1m20.0s

running (0m53.0s), 200/200 VUs, 47728 complete and 0 interrupted iterations
default   [  66% ] 200/200 VUs  0m53.0s/1m20.0s

running (0m54.0s), 200/200 VUs, 48728 complete and 0 interrupted iterations
default   [  67% ] 200/200 VUs  0m54.0s/1m20.0s

running (0m55.0s), 200/200 VUs, 50629 complete and 0 interrupted iterations
default   [  69% ] 200/200 VUs  0m55.0s/1m20.0s

running (0m56.0s), 200/200 VUs, 52528 complete and 0 interrupted iterations
default   [  70% ] 200/200 VUs  0m56.0s/1m20.0s

running (0m57.0s), 200/200 VUs, 54528 complete and 0 interrupted iterations
default   [  71% ] 200/200 VUs  0m57.0s/1m20.0s

running (0m58.0s), 200/200 VUs, 56528 complete and 0 interrupted iterations
default   [  72% ] 200/200 VUs  0m58.0s/1m20.0s

running (0m59.0s), 200/200 VUs, 58471 complete and 0 interrupted iterations
default   [  74% ] 200/200 VUs  0m59.0s/1m20.0s

running (1m00.0s), 200/200 VUs, 58928 complete and 0 interrupted iterations
default   [  75% ] 200/200 VUs  1m00.0s/1m20.0s

running (1m01.0s), 200/200 VUs, 60728 complete and 0 interrupted iterations
default   [  76% ] 200/200 VUs  1m01.0s/1m20.0s

running (1m02.0s), 200/200 VUs, 62728 complete and 0 interrupted iterations
default   [  77% ] 200/200 VUs  1m02.0s/1m20.0s

running (1m03.0s), 200/200 VUs, 64728 complete and 0 interrupted iterations
default   [  79% ] 200/200 VUs  1m03.0s/1m20.0s

running (1m04.0s), 200/200 VUs, 66728 complete and 0 interrupted iterations
default   [  80% ] 200/200 VUs  1m04.0s/1m20.0s

running (1m05.0s), 200/200 VUs, 68728 complete and 0 interrupted iterations
default   [  81% ] 200/200 VUs  1m05.0s/1m20.0s

running (1m06.0s), 200/200 VUs, 69928 complete and 0 interrupted iterations
default   [  82% ] 200/200 VUs  1m06.0s/1m20.0s

running (1m07.0s), 200/200 VUs, 70728 complete and 0 interrupted iterations
default   [  84% ] 200/200 VUs  1m07.0s/1m20.0s

running (1m08.0s), 200/200 VUs, 72728 complete and 0 interrupted iterations
default   [  85% ] 200/200 VUs  1m08.0s/1m20.0s

running (1m09.0s), 200/200 VUs, 74728 complete and 0 interrupted iterations
default   [  86% ] 200/200 VUs  1m09.0s/1m20.0s

running (1m10.0s), 200/200 VUs, 76728 complete and 0 interrupted iterations
default   [  87% ] 200/200 VUs  1m10.0s/1m20.0s

running (1m11.0s), 181/200 VUs, 78647 complete and 0 interrupted iterations
default   [  89% ] 181/200 VUs  1m11.0s/1m20.0s

running (1m12.0s), 163/200 VUs, 80307 complete and 0 interrupted iterations
default   [  90% ] 163/200 VUs  1m12.0s/1m20.0s

running (1m13.0s), 157/200 VUs, 80687 complete and 0 interrupted iterations
default   [  91% ] 157/200 VUs  1m13.0s/1m20.0s

running (1m14.0s), 122/200 VUs, 81892 complete and 0 interrupted iterations
default   [  92% ] 122/200 VUs  1m14.0s/1m20.0s

running (1m15.0s), 101/200 VUs, 83020 complete and 0 interrupted iterations
default   [  94% ] 101/200 VUs  1m15.0s/1m20.0s

running (1m16.0s), 081/200 VUs, 83940 complete and 0 interrupted iterations
default   [  95% ] 081/200 VUs  1m16.0s/1m20.0s

running (1m17.0s), 062/200 VUs, 84594 complete and 0 interrupted iterations
default   [  96% ] 062/200 VUs  1m17.0s/1m20.0s

running (1m18.0s), 041/200 VUs, 85121 complete and 0 interrupted iterations
default   [  97% ] 041/200 VUs  1m18.0s/1m20.0s

running (1m19.0s), 025/200 VUs, 85393 complete and 0 interrupted iterations
default   [  99% ] 025/200 VUs  1m19.0s/1m20.0s

running (1m20.0s), 001/200 VUs, 85427 complete and 0 interrupted iterations
default   [ 100% ] 001/200 VUs  1m20.0s/1m20.0s

     ✓ status 200

     checks.........................: 100.00% 85428 out of 85428
     data_received..................: 75 MB   939 kB/s
     data_sent......................: 7.6 MB  95 kB/s
     http_req_blocked...............: avg=7.84µs   min=0s       med=2µs      max=4.53ms   p(90)=4µs      p(95)=6µs     
     http_req_connecting............: avg=4.41µs   min=0s       med=0s       max=4.43ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=16.8ms   min=227µs    med=1.25ms   max=901.03ms p(90)=4.14ms   p(95)=5.99ms  
       { expected_response:true }...: avg=16.8ms   min=227µs    med=1.25ms   max=901.03ms p(90)=4.14ms   p(95)=5.99ms  
     http_req_failed................: 0.00%   0 out of 85428
     http_req_receiving.............: avg=45.57µs  min=4µs      med=16µs     max=10.67ms  p(90)=74µs     p(95)=123µs   
     http_req_sending...............: avg=17.48µs  min=1µs      med=5µs      max=7.24ms   p(90)=22µs     p(95)=58µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=16.74ms  min=205µs    med=1.2ms    max=901.02ms p(90)=4.01ms   p(95)=5.82ms  
     http_reqs......................: 85428   1067.127621/s
     iteration_duration.............: avg=117.33ms min=100.26ms med=101.81ms max=1s       p(90)=105.08ms p(95)=107.11ms
     iterations.....................: 85428   1067.127621/s
     vus............................: 1       min=1              max=200
     vus_max........................: 200     min=200            max=200


running (1m20.1s), 000/200 VUs, 85428 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  1m20s