perf-tests/results_v2_20260420_170456/vt/vegeta_customers_1k.txt
Requests      [total, rate, throughput]         30000, 1000.03, 1000.02
Duration      [total, attack, wait]             29.999s, 29.999s, 313.667µs
Latencies     [min, mean, 50, 90, 95, 99, max]  216.916µs, 3.438ms, 379.395µs, 740.53µs, 4.645ms, 118.946ms, 333.875ms
Bytes In      [total, mean]                     22620000, 754.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:30000  
Error Set: